Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# diffViewer.empty.branch
source: No branch changes to diff.
ar: لا توجد تغييرات في الفرع لعرض الفروقات.
de: Keine Branch-Änderungen für Diff vorhanden.
es: No hay cambios en la rama para comparar.
fr: Aucun changement de branche à comparer.
ja: 差分表示するブランチの変更はありません。
ko: 변경 사항을 비교할 브랜치 변경 사항이 없습니다.
zh_hans: 没有可比较的分支更改。
zh_hant: 無分支變更可進行差異比較。

# diffViewer.empty.lastTurn
source: No last-turn changes to diff.
ar: لا توجد تغييرات من الجولة الأخيرة لعرض الفروقات.
de: Keine Änderungen aus dem letzten Schritt für Diff vorhanden.
es: No hay cambios del último turno para comparar.
fr: Aucun changement du dernier tour à comparer.
ja: 差分表示する前回のターンの変更はありません。
ko: 변경 사항을 비교할 이전 턴의 변경 사항이 없습니다.
zh_hans: 没有可比较的上一轮更改。
zh_hant: 無上一輪變更可進行差異比較。

# diffViewer.empty.staged
source: No staged changes to diff.
ar: لا توجد تغييرات مدرجة (staged) لعرض الفروقات.
de: Keine gestageten Änderungen für Diff vorhanden.
es: No hay cambios preparados para comparar.
fr: Aucun changement indexé à comparer.
ja: 差分表示するステージ済みの変更はありません。
ko: 변경 사항을 비교할 스테이징된 변경 사항이 없습니다.
zh_hans: 没有可比较的已暂存更改。
zh_hant: 無暫存變更可進行差異比較。

# diffViewer.empty.unstaged
source: No unstaged changes to diff.
ar: لا توجد تغييرات غير مدرجة (unstaged) لعرض الفروقات.
de: Keine ungestageten Änderungen für Diff vorhanden.
es: No hay cambios sin preparar para comparar.
fr: Aucun changement non indexé à comparer.
ja: 差分表示する未ステージの変更はありません。
ko: 변경 사항을 비교할 스테이징되지 않은 변경 사항이 없습니다.
zh_hans: 没有可比较的未暂存更改。
zh_hant: 無未暫存變更可進行差異比較。

# diffViewer.enableWordDiffs
source: Enable word diffs
ar: تمكين الفروقات على مستوى الكلمات
de: Wort-Diffs aktivieren
es: Activar diferencias de palabras
fr: Activer les diffs par mot
ja: 単語単位の差分を有効にする
ko: 단어 단위 변경 설정
zh_hans: 启用词级差异
zh_hant: 啟用單字差異

# diffViewer.enableWordWrap
source: Enable word wrap
ar: تمكين التفاف الكلمات
de: Zeilenumbruch aktivieren
es: Activar ajuste de línea
fr: Activer le retour à la ligne automatique
ja: 折り返しを有効にする
ko: 자동 줄 바꿈 설정
zh_hans: 启用自动换行
zh_hant: 啟用自動換行

# diffViewer.error.allowlistTooLarge
source: Diff viewer allowlist is too large
ar: قائمة عارض الفروق المسموحة كبيرة جداً
de: Diff-Viewer-Erlaubnisliste ist zu groß
es: La lista de permitidos del visor de diferencias es demasiado grande
fr: La liste d’autorisation du visualiseur de diff est trop grande
ja: 差分ビューアの許可リストが大きすぎます
ko: Diff 뷰어 허용 목록이 너무 큽니다
zh_hans: Diff 查看器的允许列表过大
zh_hant: Diff 檢視器允許清單過大

# diffViewer.expandAllDiffs
source: Expand all diffs
ar: توسيع جميع الفروقات
de: Alle Diffs erweitern
es: Expandir todas las diferencias
fr: Développer tous les diffs
ja: すべての差分を展開
ko: 모든 변경 사항 펼치기
zh_hans: 展开所有差异
zh_hant: 展開所有差異

# diffViewer.expandUnchangedContext
source: Expand unchanged context
ar: توسيع السياق غير المعدل
de: Unveränderten Kontext erweitern
es: Expandir contexto sin cambios
fr: Développer le contexte inchangé
ja: 未変更のコンテキストを展開
ko: 변경되지 않은 컨텍스트 펼치기
zh_hans: 展开未更改的上下文
zh_hant: 展開未變更的內容

# diffViewer.files
source: Files
ar: ملفات
de: Dateien
es: Archivos
fr: Fichiers
ja: ファイル
ko: 파일
zh_hans: 文件
zh_hant: 文件

# diffViewer.findClose
source: Close find
ar: إغلاق البحث
de: Suche schließen
es: Cerrar búsqueda
fr: Fermer la recherche
ja: 検索を閉じる
ko: 찾기 닫기
zh_hans: 关闭查找
zh_hant: 關閉尋找

# diffViewer.findInDiff
source: Find in diff
ar: البحث في الفروقات
de: In Diff suchen
es: Buscar en las diferencias
fr: Rechercher dans le diff
ja: 差分内を検索
ko: 변경 사항에서 찾기
zh_hans: 在 diff 中查找
zh_hant: 在差異中尋找

# diffViewer.findNextMatch
source: Next match
ar: المباراة القادمة
de: Nächstes Spiel
es: Próximo partido
fr: Prochain match
ja: 次の一致
ko: 다음 경기
zh_hans: 下一个匹配项
zh_hant: 下一場比賽

# diffViewer.findPreviousMatch
source: Previous match
ar: المباراة السابقة
de: Vorheriges Spiel
es: Partido anterior
fr: Match précédent
ja: 前の一致
ko: 이전 경기
zh_hans: 上一个匹配项
zh_hant: 上一場比賽

# diffViewer.hideBackgrounds
source: Hide backgrounds
ar: إخفاء الخلفيات
de: Hintergründe ausblenden
es: Ocultar fondos
fr: Masquer les arrière-plans
ja: 背景を非表示
ko: 배경 숨기기
zh_hans: 隐藏背景
zh_hant: 隱藏背景

# diffViewer.hideFileSearch
source: Hide file search
ar: إخفاء بحث الملفات
de: Dateisuche ausblenden
es: Ocultar búsqueda de archivos
fr: Masquer la recherche de fichiers
ja: ファイル検索を非表示
ko: 파일 검색 숨기기
zh_hans: 隐藏文件搜索
zh_hant: 隱藏檔案搜尋

# diffViewer.hideFiles
source: Hide files
ar: إخفاء الملفات
de: Dateien ausblenden
es: Ocultar archivos
fr: Masquer les fichiers
ja: ファイルを非表示
ko: 파일 숨기기
zh_hans: 隐藏文件
zh_hant: 隱藏檔案

# diffViewer.hideLineNumbers
source: Hide line numbers
ar: إخفاء أرقام الأسطر
de: Zeilennummern ausblenden
es: Ocultar números de línea
fr: Masquer les numéros de ligne
ja: 行番号を非表示
ko: 줄 번호 숨기기
zh_hans: 隐藏行号
zh_hant: 隱藏行號

# diffViewer.indicatorStyle
source: Indicator style
ar: نمط المؤشر
de: Indikatorstil
es: Estilo de indicador
fr: Style de l’indicateur
ja: インジケータースタイル
ko: 표시기 스타일
zh_hans: 指示器样式
zh_hant: 指標樣式

# diffViewer.jumpToFile
source: Jump to file
ar: الانتقال إلى ملف
de: Zu Datei springen
es: Ir al archivo
fr: Aller au fichier
ja: ファイルへ移動
ko: 파일로 이동
zh_hans: 跳转到文件
zh_hant: 跳至檔案

# diffViewer.loadingDiff
source: Loading diff...
ar: جاري تحميل الفروقات...
de: Diff wird geladen...
es: Cargando diferencias...
fr: Chargement du diff...
ja: 差分を読み込み中...
ko: 변경 사항 불러오는 중...
zh_hans: 正在加载差异...
zh_hant: 正在載入差異...

# diffViewer.loadingDiffTarget
source: Loading diff: %@
ar: جاري تحميل الفروقات: %@
de: Diff wird geladen: %@
es: Cargando diferencias: %@
fr: Chargement du diff : %@
ja: 差分を読み込み中: %@
ko: 변경 사항 불러오는 중: %@
zh_hans: 正在加载差异：%@
zh_hant: 正在載入差異：%@

# diffViewer.loadingRenderer
source: Loading renderer...
ar: جاري تحميل أداة العرض...
de: Renderer wird geladen...
es: Cargando renderizador...
fr: Chargement du moteur de rendu...
ja: レンダラーを読み込み中...
ko: 렌더러 불러오는 중...
zh_hans: 正在加载渲染器...
zh_hant: 正在載入轉譯器...

# diffViewer.modeChange
source: Mode {old} → {new}
ar: الوضع {old} → {new}
de: Modus {old} → {new}
es: Modo {old} → {new}
ja: モード {old} → {new}
ko: 모드 {old} → {new}
zh_hans: 模式 {old} → {new}
zh_hant: 模式 {old} → {new}

# diffViewer.noComments
source: No comments yet
ar: لا توجد تعليقات بعد
de: Noch keine Kommentare
es: Aún no hay comentarios
fr: Aucun commentaire pour l’instant
ja: コメントはまだありません
ko: 작성된 댓글이 없습니다
zh_hans: 暂无评论
zh_hant: 尚無註解

# diffViewer.noFileDiffs
source: No file diffs found in patch input.
ar: لم يتم العثور على فروق للملفات في مدخلات الرقعة.
de: Keine Datei-Diffs in Patch-Eingabe gefunden.
es: No se encontraron diferencias de archivo en la entrada del parche.
fr: Aucun diff de fichier trouvé dans le patch fourni.
ja: パッチ入力にファイル差分が見つかりません。
ko: 패치 입력에서 파일 변경 사항을 찾을 수 없습니다.
zh_hans: 在补丁输入中未找到文件差异。
zh_hant: 在修補檔輸入中找不到檔案差異。

# diffViewer.none
source: None
ar: بلا
de: Keine
es: Ninguno
fr: Aucun
ja: なし
ko: 없음
zh_hans: 无
zh_hant: 無

# diffViewer.openSourceURL
source: Open source URL
ar: فتح رابط المصدر
de: Quell-URL öffnen
es: Abrir URL de origen
fr: Ouvrir l’URL source
ja: ソース URL を開く
ko: 소스 URL 열기
zh_hans: 打开源 URL
zh_hant: 開啟來源 URL

# diffViewer.options
source: Options
ar: خيارات
de: Optionen
es: Opciones
ja: オプション
ko: 옵션
zh_hans: 选项
zh_hant: 選項

# diffViewer.outdatedComment
source: Outdated
ar: قديم
de: Veraltet
es: Desactualizado
fr: Obsolète
ja: 古くなっています
ko: 만료됨
zh_hans: 已过时
zh_hant: 已過時

# diffViewer.parsingDiff
source: Parsing diff...
ar: جاري تحليل الفروقات...
de: Diff wird verarbeitet...
es: Analizando diferencias...
fr: Analyse du diff...
ja: 差分を解析中...
ko: 변경 사항 파싱 중...
zh_hans: 正在解析差异...
zh_hant: 正在剖析差異...

# diffViewer.refGroup.branches
source: Branches
ar: الفروع
es: Ramas
ja: ブランチ
ko: 브랜치
zh_hans: 分支
zh_hant: 分支

# diffViewer.refGroup.recent
source: Recent
ar: مؤخرًا
de: Jüngste
es: Reciente
fr: Récent
ja: 最近
ko: 최근의
zh_hans: 最近
zh_hant: 最近的

# diffViewer.refGroup.remotes
source: Remotes
ar: الفروع البعيدة
es: Remotos
fr: Branches distantes
ja: リモート
ko: 원격
zh_hans: 远程
zh_hant: 遠端

# diffViewer.refGroup.suggested
source: Suggested
ar: مقترح
de: Empfohlen
es: sugerido
fr: Suggéré
ja: おすすめ
ko: 제안
zh_hans: 建议
zh_hant: 建議

# diffViewer.refGroup.worktrees
source: Worktrees
ar: شجرات العمل
es: Árboles de trabajo
fr: Arbres de travail
ja: ワークツリー
ko: 작업 트리
zh_hans: 工作树
zh_hant: 工作樹

# diffViewer.refresh
source: Refresh
ar: تحديث
de: Aktualisieren
es: Refrescar
fr: Rafraîchir
ja: 更新
ko: 새로 고치다
zh_hans: 刷新
zh_hant: 重新整理

# diffViewer.renderFailed
source: Could not render this diff. Check the patch input and try again.
ar: تعذر عرض هذه الفروقات. تحقق من مدخلات الرقعة وحاول مرة أخرى.
de: Dieses Diff konnte nicht gerendert werden. Überprüfe die Patch-Eingabe und versuche es erneut.
es: No se pudo renderizar esta diferencia. Comprueba la entrada del parche e inténtalo de nuevo.
fr: Impossible de générer le rendu de ce diff. Vérifiez le patch fourni et réessayez.
ja: 差分を描画できませんでした。パッチ入力を確認してから再試行してください。
ko: 이 변경 사항을 렌더링할 수 없습니다. 패치 입력을 확인하고 다시 시도하세요.
zh_hans: 无法渲染此差异。请检查补丁输入后重试。
zh_hant: 無法轉譯此差異。請檢查修補檔輸入並重試。

# diffViewer.renderingDiff
source: Rendering diff...
ar: جاري عرض الفروقات...
de: Diff wird gerendert...
es: Renderizando diferencias...
fr: Rendu du diff en cours...
ja: 差分を描画中...
ko: 변경 사항 렌더링 중...
zh_hans: 正在渲染差异...
zh_hant: 正在轉譯差異...

# diffViewer.repoPath
source: Repository path
ar: مسار المستودع
de: Repository-Pfad
es: Ruta del repositorio
fr: Chemin du dépôt
ja: リポジトリパス
ko: 저장소 경로
zh_hans: 仓库路径
zh_hant: 存放庫路徑

# diffViewer.saveComment
source: Comment
ar: تعليق
de: Kommentar
es: Comentar
fr: Commenter
ja: コメント
ko: 댓글 작성
zh_hans: 评论
zh_hant: 註解

# diffViewer.showBackgrounds
source: Show backgrounds
ar: إظهار الخلفيات
de: Hintergründe anzeigen
es: Mostrar fondos
fr: Afficher les arrière-plans
ja: 背景を表示
ko: 배경 표시
zh_hans: 显示背景
zh_hant: 顯示背景

# diffViewer.showFileSearch
source: Show file search
ar: إظهار بحث الملفات
de: Dateisuche anzeigen
es: Mostrar búsqueda de archivos
fr: Afficher la recherche de fichiers
ja: ファイル検索を表示
ko: 파일 검색 표시
zh_hans: 显示文件搜索
zh_hant: 顯示檔案搜尋

# diffViewer.showFiles
source: Show files
ar: إظهار الملفات
de: Dateien anzeigen
es: Mostrar archivos
fr: Afficher les fichiers
ja: ファイルを表示
ko: 파일 표시
zh_hans: 显示文件
zh_hant: 顯示檔案

# diffViewer.showLineNumbers
source: Show line numbers
ar: إظهار أرقام الأسطر
de: Zeilennummern anzeigen
es: Mostrar números de línea
fr: Afficher les numéros de ligne
ja: 行番号を表示
ko: 줄 번호 표시
zh_hans: 显示行号
zh_hant: 顯示行號

# diffViewer.source.branch
source: Branch
ar: فرع
es: Rama
fr: Branche
ja: ブランチ
ko: 브랜치
zh_hans: 分支
zh_hant: 分支

# diffViewer.source.lastTurn
source: Last turn
ar: الجولة الأخيرة
de: Letzter Schritt
es: Último turno
fr: Dernier tour
ja: 前回のターン
ko: 이전 턴
zh_hans: 上一轮
zh_hant: 上一輪

# diffViewer.source.staged
source: Staged
ar: مرحلة
de: Gestaged
es: Preparado
fr: Indexé
ja: ステージ済み
ko: 스테이징됨
zh_hans: 已暂存
zh_hant: 已暫存

# diffViewer.source.unstaged
source: Unstaged
ar: غير مرحلة
de: Nicht gestaged
es: Sin preparar
fr: Non indexé
ja: 未ステージ
ko: 스테이징되지 않음
zh_hans: 未暂存
zh_hant: 未暫存

# diffViewer.switchToSplitDiff
source: Switch to split diff
ar: التبديل إلى تقسيم الفروقات
de: Zu geteilter Aufteilung wechseln
es: Cambiar a diff dividido
fr: Passer au diff divisé
ja: 分割差分に切り替え
ko: 분할 뷰로 전환
zh_hans: 切换到分栏差异
zh_hant: 切換至分割差異

# diffViewer.switchToUnifiedDiff
source: Switch to unified diff
ar: التبديل إلى الفروقات الموحدة
de: Zu zusammengeführtem Diff wechseln
es: Cambiar a diff unificado
fr: Passer au diff unifié
ja: 統合差分に切り替え
ko: 통합 뷰로 전환
zh_hans: 切换到统一差异
zh_hant: 切換至合併差異

# diffViewer.title.branchDiff
source: Branch diff
ar: فروقات الفرع
es: Diff de rama
fr: Diff de branche
ja: ブランチ差分
ko: 브랜치 변경 사항
zh_hans: 分支差异
zh_hant: 分支差異

# diffViewer.title.lastTurnDiff
source: Last turn diff
ar: فروقات الجولة الأخيرة
de: Letzter-Schritt-Diff
es: Diff del último turno
fr: Diff du dernier tour
ja: 前回のターンの差分
ko: 이전 턴 변경 사항
zh_hans: 上一轮差异
zh_hant: 上一輪差異

# diffViewer.title.stagedChanges
source: Staged changes
ar: التغييرات المرحّلة
de: Gestagete Änderungen
es: Cambios preparados
fr: Changements indexés
ja: ステージ済みの変更
ko: 스테이징된 변경 사항
zh_hans: 已暂存的更改
zh_hant: 已暫存的變更

# diffViewer.title.unstagedChanges
source: Unstaged changes
ar: التغييرات غير المرحّلة
de: Ungestagete Änderungen
es: Cambios sin preparar
fr: Changements non indexés
ja: 未ステージの変更
ko: 스테이징되지 않은 변경 사항
zh_hans: 未暂存的更改
zh_hant: 未暫存的變更

# diffViewer.untitled
source: Untitled
ar: بلا عنوان
de: Unbenannt
es: Sin título
fr: Sans titre
ja: 無題
ko: 제목 없음
zh_hans: 未命名
zh_hant: 未命名

# dock.action.focusControl
source: Focus Control
ar: تركيز التحكم
de: Steuerung fokussieren
es: Enfocar control
fr: Cibler le contrôle
ja: コントロールにフォーカス
ko: 컨트롤 포커스
zh_hans: 聚焦控件
zh_hant: 聚焦控制

# dock.action.newBrowser
source: New Browser
ar: متصفح جديد
de: Neuer Browser
es: Nuevo navegador
fr: Nouveau navigateur
ja: 新しいブラウザ
ko: 새 브라우저
zh_hans: 新建浏览器
zh_hant: 新瀏覽器

# dock.action.newSurface
source: New Dock Pane
ar: جزء Dock جديد
de: Neues Dock-Teilfenster
es: Nuevo panel de Dock
fr: Nouveau volet de Dock
ja: 新しいDockペイン
ko: 새 Dock 분할 창
zh_hans: 新建 Dock 窗格
zh_hant: 新增 Dock 窗格

# dock.action.newTerminal
source: New Terminal
ar: المحطة الجديدة
de: Neues Terminal
es: Nueva Terminal
fr: Nouveau terminal
ja: 新しいターミナル
ko: 새로운 터미널
zh_hans: 新建终端
zh_hant: 新航廈

# dock.action.openConfig
source: Open Dock Config
ar: فتح تكوين Dock
de: Dock-Konfiguration öffnen
es: Abrir configuración del Dock
fr: Ouvrir la configuration du Dock
ja: Dock設定を開く
ko: Dock 설정 열기
zh_hans: 打开 Dock 配置
zh_hant: 開啟 Dock 設定

# dock.action.reload
source: Reload Dock
ar: إعادة تحميل Dock
de: Dock neu laden
es: Recargar Dock
fr: Recharger le Dock
ja: Dockを再読み込み
ko: Dock 새로고침
zh_hans: 重新加载 Dock
zh_hant: 重新載入 Dock

# dock.action.restartControl
source: Restart Control
ar: إعادة تشغيل التحكم
de: Steuerung neu starten
es: Reiniciar control
fr: Redémarrer le contrôle
ja: コントロールを再起動
ko: 컨트롤 재시작
zh_hans: 重启控件
zh_hant: 重新啟動控制
